
// المزود لرصيد البنك
import 'package:flutter_riverpod/flutter_riverpod.dart';

final balanceProvider = StateProvider<double>((ref) => 1200.50);

// المزود للمدفوعات
final paymentsProvider = StateProvider<List<String>>((ref) => [
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
  '1: \$50.00',
  '2: \$30.00',
  '3: \$100.00',
]);
